# `````````````````ДЗ````````````````````````#
# first = "Моя первая переменная!"
# second = "И не последняя !"
# print(first)
# print(second)

# `````````````````ДЗ````````````````````````#
# name = input("Введите ваше имя :")
# color = input("Ваш любимый цвет : ")
# sport = input("Каким спортом вы занимаетесь ? :")
# print("Привет",name)
# print("Твой любимый цвет это" ,color , "?")
# print("А занимаешься ты " , sport)

# `````````````````ДЗ2```````````````````````#
# name_1 = input("Введите первое имя :")
# name_2 = input("Введите второе имя :")
# print("Привет ,")
# print(name_1)
# print("Привет ,")
# print(name_2)

# `````````````````ДЗ3```````````````````````#
# sur_name = input('Введите фамилию: ')
# print('Ваша фамилия - ')
# print(sur_name)

# `````````````````ДЗ1```````````````````````#
# surname = input("Ваша фамилия ? :")
# print("HI", surname )

# `````````````````ДЗ2```````````````````````#
# wirbs_1 = input("Введите первое слово :")
# wirbs_2 = input("Введите второе слово :")
# print(wirbs_1  +  wirbs_2)

# `````````````````ДЗ3```````````````````````#
# animal_1 = "заяц"
# animal_2 = "черепаха"
# print(animal_1 +  " спит, " +animal_2 + " идёт")

# `````````````````ДЗ4```````````````````````#
# first_name = input('Введите имя пользователя: ')
# greeting = 'Утро доброе!'
# print(greeting, first_name)
# intro = "К сожалению, у Вас нет доступа к системе."
# info = "Пожалуйста, обратитесь к системному администратору."

# print(intro , info)
# `````````````````ДЗ5```````````````````````#
# where_from = input("Откуда вылетаете ?:")
# where_for = input("Куда летите ?:")
# print(where_from + " - " + where_for)

# `````````````````ДЗ6```````````````````````#
# user = input("Введите имя пользователя :")
# new_file = input("Введите имя файла :")
# print("Путь к файлу " +"C/:"+user+"/docs/folder/"+new_file+".txt" )

# `````````````````Дз1```````````````````````#
# print("6 * 39")
# print("3 ** 5")
# print("-8 / -4")
# print("10 / 2 + 6")

# `````````````````Дз2```````````````````````#
# x = 15
# y = -7
# y = 147
# print(" a * b - c")
# print("a ** (b** c )")

# `````````````````Дз1```````````````````````#
# a = 8
# b = 5
# c = 3
# print("(a / (b + c) - c ) / c")

# `````````````````Дз2```````````````````````#
# bus = 5
# metro = 3
# result = ((6 + (10 - bus)**2) / metro + 1) + 132 / (2 + bus)
# print(result)
#
# print (- 3 + (8 * 2 - 12) * 4**(3**2)) / (2 * 18)

# `````````````````Дз1```````````````````````#
# a = int(input("Введите первое число :"))
# b = int(input("Введите второе число :"))
# c = int(input("Введите третье число :"))
# d = int(input("Введите четвёртое число :"))
# print(2*(c + 5 + ((a*b) / (4*b)) )*(d - 2*(a ** 3 / 30) - 10 ))

# `````````````````Дз1```````````````````````#
# number = int(input("Введите число:"))
# home_number = number // 10
# door_number = number % 10
# print("Номер дома :" , home_number )
# print("Номер квартиры:" , door_number)

# `````````````````Дз1```````````````````````#
# a = 8
# b = 10
# c = 12
# d = 18
#
# res = ( (- 3) + (a**2) * (b - (2 ** 3))) / (c - 2 * d)
# print(res)

# `````````````````Дз1```````````````````````#
# number = int(input("Введите число :"))
# print ("После числа ", number , "идёт число 6")
# print ("До числа ", number , "идёт число 4")

# `````````````````Дз1```````````````````````#
# katet_a = int(input("Введите длину катета А :"))
# katet_b = int(input("Введите длину катета B :"))
# S = (katet_a * katet_b) / 2
#
# print("Площадь равняется :" , S)

# `````````````````Дз1```````````````````````#
# n = int(input("Введите кол - во минут :"))
#
# ccl = n // 60
# print(ccl , "Часов")

# `````````````````Дз1```````````````````````#
# first_number = int(input("Введите первое число :"))
# second_number = int(input("Введите второе число :"))
# a = first_number % 100
# b = second_number % 100
# print(a + b)

# `````````````````Дз1```````````````````````#
# number = input("Введите четырёхзначное число: ")
#
# for digit in number:
#     print(digit)

# `````````````````Дз```````````````````````#
# first_number = 10
# second_number = 20
# sum_number = 30
# print("Какова будет ссума 10 и 20 ?")
#
# answer = int(input("Ваш ответ?: "))
# if answer == sum_number :
#         print("Правильный ответ!!")
# else :
#         print("Попробуй ещё раз :)")

# `````````````````Дз```````````````````````#
# number = int(input("Введите 0 или 1"))
# if number == 1 :
#     print("Пошёл дождь. Возьмите зонтик!")
# if number == 0 :
#     print("Дождя нет!")
# else :
#     print("Выберете между 0 и 1")

# `````````````````Дз```````````````````````#
# ru_laung = int(input("Введите количество баллов по русскому языку:"))
# math = int(input("Введите количество баллов по математике:"))
# computer_science = int(input("Введите количество баллов по информатике:"))
# sum = ru_laung + math + computer_science
# if sum >= 270 :
#     print ("Поздравляю, ты поступил на бюджет!")
# else :
#     print ("К сожалению, ты не прошёл на бюджет.")

# `````````````````Дз```````````````````````#
# number = int(input("Введите число :"))
# if number % 2 == 0 :
#     print ("Сегодня предстоит поработать!")
# else :
#     print ("Можно и отдохнуть")

# `````````````````Дз```````````````````````#
# item_1 = int(input("Введите сумму первого товара:"))
# item_2 = int(input("Введите сумму второго товара:"))
# item_3 = int(input("Введите сумму третьего товара:"))
# sum = item_1 + item_2 + item_3
# if sum > 10000 :
#     sum -= sum * 0.10
# print ("К оплате:", sum)

# `````````````````Дз```````````````````````#
# item = int(input("Введите число :"))
# resoult = item * (-1)
# if item >= 0 :
#     resoult = item * 1
# print("Вы ввели:" , item , "Ответ:" , resoult)

# # `````````````````Дз```````````````````````#
# x = int(input("Введите число: "))
# if x < 0:
#     x = -x
# print("Модуль числа:", x)

# # `````````````````Дз```````````````````````#
# digit_1 = int(input("Введите число :"))
# digit_2 = int(input("Введите число :"))
#
# if digit_1 <= digit_2 :
#     print("Игрок платит , " , "число игрока: " , digit_1)
# else :
#     print("Владелец платит , " , "число владельца: " , digit_2)
# print("Игра окончена")

# # `````````````````Дз```````````````````````#
# x = int(input("Введите значение x: "))
# y = int(input("Введите значение y: "))
#
# if x < y:
#     print("X меньше Y")
# elif x > y:
#     print("X больше Y")
# else:
#     print("X равен Y")

# `````````````````Дз```````````````````````#
# course_price = 75000
# your_wallet = 78500
# payment = int(input("Введите сумму покупки:"))
#
# if payment <= your_wallet:
#     your_wallet -= payment
# if your_wallet < 5000:
#     your_wallet += 1000
#     print("Сделана скидка")
#     print("Курс успешно приобретён!")
# else:
#     print("Остаток на счету: ", your_wallet)
#     print("Хорошего дня!")

# `````````````````Дз```````````````````````#
# course_price = 75000
# your_wallet = 78500
#
# if your_wallet >= course_price:
#     your_wallet -= course_price
#
#     if your_wallet < 5000:
#         your_wallet += 1000
#         print("Сделана скидка")
#     print("Курс успешно приобретён!")
# else:
#     print("Не хватает денег на счету")
#
# print(f"Остаток на счету: {your_wallet}")
# print("Хорошего дня!")
# `````````````````Дз```````````````````````#
# money = int(input("Введите количество денег: "))
# cheese_price = 60
# ice_cream_price = 20
# if money >= cheese_price:
#     print("На сыр денег хватило")
#     money -= cheese_price
#
#     if money >= ice_cream_price:
#         print("И на мороженое тоже!")
#         money -= ice_cream_price
#     else:
#         print("Денег маловато")
# else:
#     print("Денег не хватило даже на сыр!")

# `````````````````Дз```````````````````````#
# first = int(input("Введите вес первой монеты: "))
# second = int(input("Введите вес второй монеты: "))
# third = int(input("Введите вес третьей монеты: "))
#
# if first == second:
#     print("Третья легче")
# elif first == third:
#     print("Вторая легче")
# else:
#     print("Первая легче")

# `````````````````Дз```````````````````````#
# scores = int(input("Введите количество баллов: "))
# medal = int(input("Введите количество медалей: "))
# if scores >= 290 and medal > 0:
#     print("Поздравляем! Ты поступил!")
# else:
#     print("К сожалению, ты не прошёл в наш университет.")

# `````````````````Дз```````````````````````#
# temperature = int(input("Введите значение теродатчика: "))
# if temperature < 0 or temperature > 100:
#     print("Опасность!")
# else:
#     print("Температура в пределах нормы")

# `````````````````Дз```````````````````````#
# exp = int(input("Введи колличество опыта:"))
# lvl = 1
# if exp >= 1000:
#     lvl += 1
#     if exp >= 2500:
#         lvl += 1
#         if exp >= 5000:
#             lvl += 1
#     print("Ваш уровеь :", lvl)
# else:
#     print("Ваш текущий уровеь :", lvl)
