# `````````````````ДЗ````````````````````````#
# first = "Моя первая переменная!"
# second = "И не последняя !"
# print(first)
# print(second)

# `````````````````ДЗ````````````````````````#
# name = input("Введите ваше имя :")
# color = input("Ваш любимый цвет : ")
# sport = input("Каким спортом вы занимаетесь ? :")
# print("Привет",name)
# print("Твой любимый цвет это" ,color , "?")
# print("А занимаешься ты " , sport)

# `````````````````ДЗ2```````````````````````#
# name_1 = input("Введите первое имя :")
# name_2 = input("Введите второе имя :")
# print("Привет ,")
# print(name_1)
# print("Привет ,")
# print(name_2)

# `````````````````ДЗ3```````````````````````#
# sur_name = input('Введите фамилию: ')
# print('Ваша фамилия - ')
# print(sur_name)

# `````````````````ДЗ1```````````````````````#
# surname = input("Ваша фамилия ? :")
# print("HI", surname )

# `````````````````ДЗ2```````````````````````#
# wirbs_1 = input("Введите первое слово :")
# wirbs_2 = input("Введите второе слово :")
# print(wirbs_1  +  wirbs_2)

# `````````````````ДЗ3```````````````````````#
# animal_1 = "заяц"
# animal_2 = "черепаха"
# print(animal_1 +  " спит, " +animal_2 + " идёт")

# `````````````````ДЗ4```````````````````````#
# first_name = input('Введите имя пользователя: ')
# greeting = 'Утро доброе!'
# print(greeting, first_name)
# intro = "К сожалению, у Вас нет доступа к системе."
# info = "Пожалуйста, обратитесь к системному администратору."

# print(intro , info)
# `````````````````ДЗ5```````````````````````#
# where_from = input("Откуда вылетаете ?:")
# where_for = input("Куда летите ?:")
# print(where_from + " - " + where_for)

# `````````````````ДЗ6```````````````````````#
# user = input("Введите имя пользователя :")
# new_file = input("Введите имя файла :")
# print("Путь к файлу " +"C/:"+user+"/docs/folder/"+new_file+".txt" )

# `````````````````Дз1```````````````````````#
# print("6 * 39")
# print("3 ** 5")
# print("-8 / -4")
# print("10 / 2 + 6")

# `````````````````Дз2```````````````````````#
# x = 15
# y = -7
# y = 147
# print(" a * b - c")
# print("a ** (b** c )")

# `````````````````Дз1```````````````````````#
# a = 8
# b = 5
# c = 3
# print("(a / (b + c) - c ) / c")

# `````````````````Дз2```````````````````````#
# bus = 5
# metro = 3
# result = ((6 + (10 - bus)**2) / metro + 1) + 132 / (2 + bus)
# print(result)
#
# print (- 3 + (8 * 2 - 12) * 4**(3**2)) / (2 * 18)

# `````````````````Дз1```````````````````````#
# a = int(input("Введите первое число :"))
# b = int(input("Введите второе число :"))
# c = int(input("Введите третье число :"))
# d = int(input("Введите четвёртое число :"))
# print(2*(c + 5 + ((a*b) / (4*b)) )*(d - 2*(a ** 3 / 30) - 10 ))

# `````````````````Дз1```````````````````````#
# number = int(input("Введите число:"))
# home_number = number // 10
# door_number = number % 10
# print("Номер дома :" , home_number )
# print("Номер квартиры:" , door_number)

# `````````````````Дз1```````````````````````#
# a = 8
# b = 10
# c = 12
# d = 18
#
# res = ( (- 3) + (a**2) * (b - (2 ** 3))) / (c - 2 * d)
# print(res)

# `````````````````Дз1```````````````````````#
# number = int(input("Введите число :"))
# print ("После числа ", number , "идёт число 6")
# print ("До числа ", number , "идёт число 4")

# `````````````````Дз1```````````````````````#
# katet_a = int(input("Введите длину катета А :"))
# katet_b = int(input("Введите длину катета B :"))
# S = (katet_a * katet_b) / 2
#
# print("Площадь равняется :" , S)

# `````````````````Дз1```````````````````````#
# n = int(input("Введите кол - во минут :"))
#
# ccl = n // 60
# print(ccl , "Часов")

# `````````````````Дз1```````````````````````#
# first_number = int(input("Введите первое число :"))
# second_number = int(input("Введите второе число :"))
# a = first_number % 100
# b = second_number % 100
# print(a + b)

# `````````````````Дз1```````````````````````#
# number = input("Введите четырёхзначное число: ")
#
# for digit in number:
#     print(digit)

# `````````````````Дз```````````````````````#
# first_number = 10
# second_number = 20
# sum_number = 30
# print("Какова будет ссума 10 и 20 ?")
#
# answer = int(input("Ваш ответ?: "))
# if answer == sum_number :
#         print("Правильный ответ!!")
# else :
#         print("Попробуй ещё раз :)")
