#2.1 Переменные

#t = "Hello world!"
#print(t)

#+++++++++++++++++++++++++++++++++++++++++++#

#2.2 Оператор ввода input

#name = input("Введите имя ")
#print("Привет")
#print(name)
#name2 = input("Введите второе имя ")
#print("Привет, ")
#print(name2)

#+++++++++++++++++++++++++++++++++++++++++++#

#2.3 Строки и конкатенация

#name = input("Введите имя ")
#print("Привет", name, "I'm - computer")

#Конкатинация#

#print("Торговая "+" Площадь")

#a = input("Введите первое слово: ")
#b = input("Введите второе слово: ")
#c = a + " середина " + b
#print(c)

#+++++++++++++++++++++++++++++++++++++++++++#

#2.4 Особенности работы с переменными

#name1, naem2, name3 = "Саша","Маша","Паша"
#print(name1,naem2,name3)

