#2.1 Переменные

#t = "Hello world!"
#print(t)

#+++++++++++++++++++++++++++++++++++++++++++#

#2.2 Оператор ввода input

#name = input("Введите имя ")
#print("Привет")
#print(name)
#name2 = input("Введите второе имя ")
#print("Привет, ")
#print(name2)

#+++++++++++++++++++++++++++++++++++++++++++#

#2.3 Строки и конкатенация

#name = input("Введите имя ")
#print("Привет", name, "I'm - computer")

#Конкатинация#

#print("Торговая "+" Площадь")

#a = input("Введите первое слово: ")
#b = input("Введите второе слово: ")
#c = a + " середина " + b
#print(c)

#+++++++++++++++++++++++++++++++++++++++++++#

#2.4 Особенности работы с переменными

#name1, naem2, name3 = "Саша","Маша","Паша"
#print(name1,naem2,name3)

#+++++++++++++++++++++++++++++++++++++++++++#

#3.2 Числа и арифметические операции с ними

#print(10+20)
#print(30/15)
#print(99-72)
#print(4**7)

#a = 12
#b = 13
#c = a + b
#print(c)
#or
#print(a + b)
#print("HI", c)

#+++++++++++++++++++++++++++++++++++++++++++#

#3.3 Приоритет арифметических операций

#+++++++++++++++++++++++++++++++++++++++++++#

#3.4 Ввод числа с клавиатуры

#a = int(input("Введите первое число :"))
#b = int(input("Введите второе число :"))
#c = a + b
#print(c)

#a = "123"
#b = "432"
#c = a + b
#d = int(c)*2
#print(d)